package qimen

//七政四余/星盘

var Constellation = []string{"Ari", "Tau", "Gem", "Can", "Leo", "Vir", "Lib", "Sco", "Sgr", "Cap", "Aqr", "Psc"}
var ConstellationShort = []string{"羊", "牛", "双", "蟹", "狮", "室", "秤", "蝎", "射", "摩", "瓶", "鱼"}
var ConstellationCN = map[string]string{
	"Ari": "白羊座", "Tau": "金牛座", "Gem": "双子座", "Can": "巨蟹座",
	"Leo": "狮子座", "Vir": "室女座", "Lib": "天秤座", "Sco": "天蝎座",
	"Sgr": "射手座", "Cap": "摩羯座", "Aqr": "水瓶座", "Psc": "双鱼座",
}

// AstrolabeGong 星盘宫名
var AstrolabeGong = []string{"",
	"命宫", "财帛", "交流", "田宅", "娱乐", "健康", "夫妻", "疾厄", "迁移", "事业", "福德", "玄秘",
}

// AstrolabeGong74 七政四余宫名
var AstrolabeGong74 = []string{"",
	"命宫", "财帛", "兄弟", "田宅", "子女", "奴仆", "夫妻", "疾厄", "迁移", "官禄", "福德", "相貌",
}

// XiuAngle 星宿角度
var XiuAngle = map[string]float32{
	"角": 12.857142857142857, "亢": 25.714285714285714, "氐": 38.57142857142857, "房": 51.42857142857143,
	"心": 64.28571428571429, "尾": 77.14285714285714, "箕": 90, "斗": 102.85714285714286, "牛": 115.71428571428571,
	"女": 128.57142857142858, "虚": 141.42857142857142, "危": 154.28571428571428, "室": 167.14285714285714,
	"壁": 180, "奎": 192.85714285714286, "娄": 205.71428571428572, "胃": 218.57142857142858, "昴": 231.42857142857142,
	"毕": 244.28571428571428, "觜": 257.14285714285717, "参": 270, "井": 282.8571428571429, "鬼": 295.7142857142857,
	"柳": 308.5714285714286, "星": 321.42857142857144, "张": 334.28571428571433, "翼": 347.14285714285717, "轸": 360,
}
